In [101]:
import pandas as pd

Create a DataFrame with a column "Address" containing values like " Karachi, Pakistan ", "lahore , Pakistan".

In [102]:
df = pd.DataFrame({
    "Name": ["John", "Jane", "Jack", "Jill", "Ali", "Ayesha", "Hassan", "Hina", "Hafsa", "Hassan"],
    "Age": [28, 22, 35, 29, 21, 24, 27, 26, 25, 28],
    "Gender": ["Male", "Female", "Male", "Female", "Male", "Female", "Male", "Female", "Female", "Male"],
    "Address": [" iqbal town  Lahore", "minar-e-pakistan Lahore ", "main market Islamabad", "quadide azam market PeShawar",
    "ziaraat Quetta", "airport Faisalabad ", "faizabad   Rawalpindi", "bilal park Hyderbad   ",
    "khatme nabuwat chowk Gojra", "kotli chowk Shorkot"]
})
df.head()

   Name  Age  Gender                       Address
0  John   28    Male            iqbal town  Lahore
1  Jane   22  Female      minar-e-pakistan Lahore
2  Jack   35    Male         main market Islamabad
3  Jill   29  Female  quadide azam market PeShawar
4   Ali   21    Male                ziaraat Quetta

In [103]:
# Clean the whitespaces.
df["Address"] = df["Address"].str.strip()
df.head()

   Name  Age  Gender                       Address
0  John   28    Male            iqbal town  Lahore
1  Jane   22  Female       minar-e-pakistan Lahore
2  Jack   35    Male         main market Islamabad
3  Jill   29  Female  quadide azam market PeShawar
4   Ali   21    Male                ziaraat Quetta

In [104]:
# Convert the addresses to title case.
df["Address"] = df["Address"].str.title()
df.head()

   Name  Age  Gender                       Address
0  John   28    Male            Iqbal Town  Lahore
1  Jane   22  Female       Minar-E-Pakistan Lahore
2  Jack   35    Male         Main Market Islamabad
3  Jill   29  Female  Quadide Azam Market Peshawar
4   Ali   21    Male                Ziaraat Quetta

In [105]:
# Split the "Address" column into two separate columns: City and Country.
df[["Town", "City"]] = df["Address"].str.rsplit(" ",n=1, expand=True)
df

,Name,Age,Gender,Address,Town,City
0,John,28,Male,Iqbal Town Lahore,Iqbal Town,Lahore
1,Jane,22,Female,Minar-E-Pakistan Lahore,Minar-E-Pakistan,Lahore
2,Jack,35,Male,Main Market Islamabad,Main Market,Islamabad
3,Jill,29,Female,Quadide Azam Market Peshawar,Quadide Azam Market,Peshawar
4,Ali,21,Male,Ziaraat Quetta,Ziaraat,Quetta
5,Ayesha,24,Female,Airport Faisalabad,Airport,Faisalabad
6,Hassan,27,Male,Faizabad Rawalpindi,Faizabad,Rawalpindi
7,Hina,26,Female,Bilal Park Hyderbad,Bilal Park,Hyderbad
8,Hafsa,25,Female,Khatme Nabuwat Chowk Gojra,Khatme Nabuwat Chowk,Gojra
9,Hassan,28,Male,Kotli Chowk Shorkot,Kotli Chowk,Shorkot

In [106]:
# Create a "Phone" column with 10 No data like "0300-1234567", "0321-7654321" "0346-1234567", "0331-1234567","0315-1234567".
df["Phone No"] = ["0300-1234567", "0321-7654321", "0346-1234567", "0331-1234567","0315-1234567", "0321-7654321", "0346-1234567", "0331-1234567","0315-1234567", "0321-7654321"]
df

,Name,Age,Gender,Address,Town,City,Phone No
0,John,28,Male,Iqbal Town Lahore,Iqbal Town,Lahore,0300-1234567
1,Jane,22,Female,Minar-E-Pakistan Lahore,Minar-E-Pakistan,Lahore,0321-7654321
2,Jack,35,Male,Main Market Islamabad,Main Market,Islamabad,0346-1234567
3,Jill,29,Female,Quadide Azam Market Peshawar,Quadide Azam Market,Peshawar,0331-1234567
4,Ali,21,Male,Ziaraat Quetta,Ziaraat,Quetta,0315-1234567
5,Ayesha,24,Female,Airport Faisalabad,Airport,Faisalabad,0321-7654321
6,Hassan,27,Male,Faizabad Rawalpindi,Faizabad,Rawalpindi,0346-1234567
7,Hina,26,Female,Bilal Park Hyderbad,Bilal Park,Hyderbad,0331-1234567
8,Hafsa,25,Female,Khatme Nabuwat Chowk Gojra,Khatme Nabuwat Chowk,Gojra,0315-1234567
9,Hassan,28,Male,Kotli Chowk Shorkot,Kotli Chowk,Shorkot,0321-7654321

In [107]:
# Extract just the network code (first 4 digits) using slicing df['Phone'].str[:4].
df["Phone No"] = df["Phone No"].str[:4]
df

,Name,Age,Gender,Address,Town,City,Phone No
0,John,28,Male,Iqbal Town Lahore,Iqbal Town,Lahore,0300
1,Jane,22,Female,Minar-E-Pakistan Lahore,Minar-E-Pakistan,Lahore,0321
2,Jack,35,Male,Main Market Islamabad,Main Market,Islamabad,0346
3,Jill,29,Female,Quadide Azam Market Peshawar,Quadide Azam Market,Peshawar,0331
4,Ali,21,Male,Ziaraat Quetta,Ziaraat,Quetta,0315
5,Ayesha,24,Female,Airport Faisalabad,Airport,Faisalabad,0321
6,Hassan,27,Male,Faizabad Rawalpindi,Faizabad,Rawalpindi,0346
7,Hina,26,Female,Bilal Park Hyderbad,Bilal Park,Hyderbad,0331
8,Hafsa,25,Female,Khatme Nabuwat Chowk Gojra,Khatme Nabuwat Chowk,Gojra,0315
9,Hassan,28,Male,Kotli Chowk Shorkot,Kotli Chowk,Shorkot,0321

In [108]:
# Filter the dataset to find all addresses that contain the word "Lahore".
lahore_addresses = df[df["Address"].str.contains("Lahore")]
lahore_addresses

,Name,Age,Gender,Address,Town,City,Phone No
0,John,28,Male,Iqbal Town Lahore,Iqbal Town,Lahore,0300
1,Jane,22,Female,Minar-E-Pakistan Lahore,Minar-E-Pakistan,Lahore,0321